{
    "version": "https://jsonfeed.org/version/1",
    "title": "Bolt News",
    "description": "",
    "home_page_url": "https://boltnews.github.io",
    "feed_url": "https://boltnews.github.io/feed.json",
    "user_comment": "",
    "icon": "https://boltnews.github.io/media/website/boltnews.png",
    "author": {
        "name": "Anuj Pandey"
    },
    "items": [
        {
            "id": "https://boltnews.github.io/a-new-beginning/",
            "url": "https://boltnews.github.io/a-new-beginning/",
            "title": "A new beginning",
            "summary": "Gossips are not news, and any news is not a gossip. Yet today its so very easy to run a propaganda machinery to get your truth as the truth. We shouldn't reject subjective truth, but that's not a universal truth either. Clearly, we as a&hellip;",
            "content_html": "<p>Gossips are not news, and any news is not a gossip. Yet today its so very easy to run a propaganda machinery to get <em>your truth</em> as <strong>the truth</strong>. We shouldn't reject subjective truth, but that's not a universal truth either. </p>\n<p>Clearly, we as a collective society needs to re-think how we define truth. Sometimes its much more exciting to see the TV news and go, <em>wow, that was fun and yet crazy talk</em>.  Personally we should object to the way news is served to us. News should be simple with unbiased opinions, clean, easy to consume. Last decade or so, mainstream media has perfected the art of using primary colors, and gigantic fonts, zooming in and out of screens, giving seizure to our not so younger part of the audience.</p>\n<p>Again, not using the fonts doesn't make your news and best news, yet at least its consumable. The author wonders often from the living room, if what he sees is what really going on, is this is something only for the <strong>SHOW</strong>. </p>\n<p>News must not be a <em>show</em> either, news is not entertainment. its information packed in a package of reports, documentaries, and pictures and videos to explain what's real and what's not. </p>\n<p> </p>",
            "image": "https://boltnews.github.io/media/posts/1/iuk3.jpg",
            "author": {
                "name": "Anuj Pandey"
            },
            "tags": [
                   "Editorial"
            ],
            "date_published": "2020-06-26T15:19:48+05:30",
            "date_modified": "2020-06-26T15:19:48+05:30"
        }
    ]
}
